{"keras_version": "1.1.2", "config": [{"config": {"gamma_regularizer": null, "mode": 0, "axis": -1, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "epsilon": 1e-05, "momentum": 0.99, "name": "batchnormalization_1", "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"W_constraint": null, "input_dtype": "float32", "b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "activation": "relu", "bias": true, "b_regularizer": null, "nb_filter": 24, "batch_input_shape": [null, 66, 200, 3], "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_1", "nb_row": 5, "trainable": true, "nb_col": 5, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "nb_filter": 36, "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_2", "nb_row": 5, "trainable": true, "nb_col": 5, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "nb_filter": 48, "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_3", "nb_row": 5, "trainable": true, "nb_col": 5, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "nb_filter": 64, "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_4", "nb_row": 3, "trainable": true, "nb_col": 3, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "nb_filter": 64, "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_5", "nb_row": 3, "trainable": true, "nb_col": 3, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "output_dim": 100, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_1", "input_dim": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "output_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_2", "input_dim": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "output_dim": 10, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_3", "input_dim": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "linear", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "output_dim": 1, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_4", "input_dim": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}